---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.KeepReadable
source: html/9b044d6f-a23a-677e-c044-013cc266b3a2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.KeepReadable Property

"Keep Readable"

## Syntax (C#)
```csharp
public static ForgeTypeId KeepReadable { get; }
```